c5/src/InformationRegisters/Membership/Membership.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Membership</name>
  <dimensions>
    <name>Membership</name>
    <comment>Do not use name &quot;Group&quot;</comment>
    <type>
      <types>CatalogRef.Membership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/Rights/Rights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Rights</name>
  <resources>
    <name>Access</name>
    <type>
      <types>EnumRef.AllowDeny</types>
    </type>
  </resources>
  <resources>
    <name>Expiration</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Warning</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>Disabled</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Target</name>
    <type>
      <types>CatalogRef.Users</types>
      <types>CatalogRef.Membership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Action</name>
    <type>
      <types>EnumRef.AccessRights</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>CatalogRef.Metadata</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DateStart</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Method</name>
    <type>
      <types>EnumRef.RestrictionMethods</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/AccessRights/AccessRights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AccessRights</name>
  <enumValues>
    <name>Any</name>
  </enumValues>
  <enumValues>
    <name>Edit</name>
  </enumValues>
  <enumValues>
    <name>Create</name>
  </enumValues>
  <enumValues>
    <name>UndoPosting</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/AllowDeny/AllowDeny.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AllowDeny</name>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Deny</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/RestrictionMethods/RestrictionMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RestrictionMethods</name>
  <enumValues>
    <name>Period</name>
  </enumValues>
  <enumValues>
    <name>Duration</name>
  </enumValues>
</mdclass:Enum>

c5/src/Catalogs/Membership/Membership.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Membership</name>
  <predefined>
    <items>
      <name>Users</name>
      <description>Users</description>
    </items>
  </predefined>
  <attributes>
    <name>TenantAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tenants</name>
    <attributes>
      <name>Tenant</name>
      <type>
        <types>CatalogRef.Tenants</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/CommonModules/DocumentFormSrv/Module.bsl
Function GetAccess ( val Ref, val Date ) export

	result = defineAccess ( Ref, Date );
	if ( result.Allowed
		and not Ref.IsEmpty () ) then
		oldDate = DF.Pick ( Ref, "Date" );
		if ( BegOfDay ( Date ) <> BegOfDay ( oldDate ) ) then
			result = defineAccess ( Ref, oldDate );
		endif;
	endif;
	return result;
	
EndFunction

Function defineAccess ( Ref, Date )
	
	rights = getRights ( Ref, Date );
	result = new Structure ( "Allowed, Action, Warning", false, undefined, false );
	if ( Ref.IsEmpty () ) then
		//@skip-warning
		stub = accessDenied ( Rights, Enums.AccessRights.Create, result )
		or accessDenied ( Rights, Enums.AccessRights.Any, result )
		or accessAllowed ( Rights, Enums.AccessRights.Create, result )
		or accessAllowed ( Rights, Enums.AccessRights.Any, result );
	else
		//@skip-warning
		stub = accessDenied ( Rights, Enums.AccessRights.Edit, result )
		or accessDenied ( Rights, Enums.AccessRights.UndoPosting, result )
		or accessDenied ( Rights, Enums.AccessRights.Any, result )
		or accessAllowed ( Rights, Enums.AccessRights.Edit, result )
		or accessAllowed ( Rights, Enums.AccessRights.UndoPosting, result )
		or accessAllowed ( Rights, Enums.AccessRights.Any, result );
	endif;
	return result;
	
EndFunction

Function accessDenied ( Rights, Action, Result )
	
	record = Rights [ Action ];
	if ( record <> undefined
		and record.Access = Enums.AllowDeny.Deny ) then
		Result.Allowed = false;
		Result.Action = Action;
		Result.Warning = record.Warning;
		return true;
	endif;
	return false;
	
EndFunction

Function accessAllowed ( Rights, Action, Result )
	
	record = Rights [ Action ];
	if ( record <> undefined
		and record.Access = Enums.AllowDeny.Allow ) then
		Result.Allowed = true;
		Result.Action = Action;
		return true;
	endif;
	return false;
	
EndFunction

Function getRights ( Ref, Date )
	
	rightsMap = new Map ();
	table = getRightsTable ( Ref, Date );
	for each row in table do
		if ( rightsMap [ row.Action ] = undefined ) then
			rightsMap [ row.Action ] = new Structure ( "Access, Warning", row.Access, row.Warning );
		endif; 
	enddo; 
	return rightsMap;
	
EndFunction 

Function getRightsTable ( Ref, Date )
	
	s = "
	|select undefined as User
	|into UserAndGroups
	|union
	|select &User
	|union
	|select Users.Membership
	|from InformationRegister.Membership as Users
	|where Users.User = &User
	|and not Users.Membership.DeletionMark
	|;
	|select Rights.Access as Access, Rights.Action as Action, Rights.Warning as Warning,
	|	case when Rights.Target = undefined then 0
	|			+ case when Rights.Document <> value ( Catalog.Metadata.EmptyRef ) then 5 else 0 end
	|			+ case when Rights.Access = value ( Enum.AllowDeny.Deny ) then 1000 else 0 end
	|		when Rights.Target refs Catalog.Membership then 10
	|			+ case when Rights.Document <> value ( Catalog.Metadata.EmptyRef ) then 5 else 0 end
	|			+ case when Rights.Access = value ( Enum.AllowDeny.Deny ) then 1000 else 0 end
	|		else 100
	|			+ case when Rights.Document <> value ( Catalog.Metadata.EmptyRef ) then 5 else 0 end
	|			+ case when Rights.Access = value ( Enum.AllowDeny.Deny ) then 1000 else 0 end
	|	end as Weight
	|from InformationRegister.Rights as Rights
	|where not Rights.Disabled
	|and Rights.Target in ( select User from UserAndGroups )
	|and Rights.Document in ( value ( Catalog.Metadata.EmptyRef ), Document = &Document )
	|and (
	|	( Rights.Method = value ( Enum.RestrictionMethods.Period )
	|		and &DocumentDate > Rights.DateStart
	|		and ( &DocumentDate < Rights.DateEnd or Rights.DateEnd = datetime ( 1, 1, 1 ) ) )
	|	or
	|	( Rights.Method = value ( Enum.RestrictionMethods.Span )
	|		and Rights.Access = value ( Enum.AllowDeny.Allow )
	|		and &DocumentDate between dateadd ( &OperationalTime, day, - Rights.Duration ) and dateadd ( &OperationalTime, day, Rights.Duration ) )
	|	or
	|	( Rights.Method = value ( Enum.RestrictionMethods.Span )
	|		and Rights.Access = value ( Enum.AllowDeny.Deny )
	|		and &DocumentDate not between dateadd ( &OperationalTime, day, - Rights.Duration ) and dateadd ( &OperationalTime, day, Rights.Duration ) )
	|	or
	|	( Rights.Method = value ( Enum.RestrictionMethods.Duration )
	|		and Rights.Access = value ( Enum.AllowDeny.Deny )
	|		and datediff ( &DocumentDate, &OperationalTime, day ) >= Rights.Duration )
	|	or
	|	( Rights.Method = value ( Enum.RestrictionMethods.Duration )
	|		and Rights.Access = value ( Enum.AllowDeny.Allow )
	|		and datediff ( &DocumentDate, &OperationalTime, day ) <= Rights.Duration )
	|	or
	|		Rights.Method = value ( Enum.RestrictionMethods.EmptyRef ) )
	|and ( &OperationalTime < Rights.Expiration or Rights.Expiration = datetime ( 1, 1, 1 ) )
	|order by Weight desc
	|";
	q = new Query ( s );
	q.TempTablesManager = new TempTablesManager ();
	q.SetParameter ( "User", SessionParameters.User );
	q.SetParameter ( "Document", MetadataRef.Get ( Metadata.FindByType ( TypeOf ( Ref ) ).FullName () ) );
	q.SetParameter ( "DocumentDate", Date );
	q.SetParameter ( "OperationalTime",	CurrentDate () );
	return q.Execute ().Unload ();
	
EndFunction
